Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_СпособыДоставкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыДоставкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ДелениеУведомленийПоАдресатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ДелениеУведомленийПоАдресатам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееДляВсех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельноКаждому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДополнительныхВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеТабличныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_СпособыАдресацииУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыАдресацииУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокРассылки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Forms/РедактированиеТемыИТекстаСообщения/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущееПоложениеНачало; // позиция начала выделения в блоке текста в HTML письме
&НаКлиенте
Перем ТекущееПоложениеКонец; // позиция конца выделения в блоке текста в HTML письме

&НаКлиенте
Перем ТекущийНомерУзла; // номер текущего узла в HTML письме

&НаКлиенте
Перем ГоризонтальнаяПрокруткаHTML; // положение гор прокрутки в HTML письме
&НаКлиенте
Перем ВертикальнаяПрокруткаHTML; // положение вертикальной прокрутки в HTML письме

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсияУТ    = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	ЭтоТакси    = ПЛ_Функции83.ЭтоТакси();
	
	ТипСообщения = Параметры.ТипСообщения;
	
	ТипСообщенияЭлПочта = (ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
		Или ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки);
	
	ВидимостьТемы = ТипСообщенияЭлПочта Или (ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение);
	Элементы.ТемаСообщения.Видимость          = ВидимостьТемы;
	Элементы.ПроверкаТемыСообщения.Видимость  = ВидимостьТемы;
	
	ОбычныйТекст                   = Параметры.ОбычныйТекст;
	Элементы.ОбычныйТекст.Пометка  = ОбычныйТекст;
	
	ТемаСообщения.Добавить(Параметры.ТемаСообщения);
	
	СтруктураВложений = Новый Структура;
	Если Параметры.Свойство("СтруктураВложений") Тогда
		СтруктураВложений = Параметры.СтруктураВложений;
	КонецЕсли;
	
	Если Параметры.Свойство("ФорматВложений") Тогда
		ФорматВложений = Параметры.ФорматВложений;
	КонецЕсли;
	
	ТекстШаблона = Параметры.ТекстСообщения;
	Если ПустаяСтрока(ТекстШаблона) Тогда
		ТекстШаблона = " ";
	КонецЕсли;
	
	Если Не ОбычныйТекст Тогда
		ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
	КонецЕсли;
	
	ИдентификаторВладельца = Параметры.УникальныйИдентификатор;
	
	// Исходная схема компоновки данных копируется в редактируемую схему компоновки данных
	ПЛ_УведомленияОСобытиях.СкопироватьСхемуКомпоновкиДанных(АдресСхемыКомпоновкиШаблонов, Параметры.АдресСхемыКомпоновкиШаблонов);
	
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиШаблонов) Тогда
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиШаблонов, Параметры.АдресНастроекКомпоновкиШаблонов);
	КонецЕсли;
	
	Если Параметры.Свойство("ИсточникСобытия", ТипОбъекта)
		И Параметры.Свойство("Регистратор", Регистратор) Тогда
		
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			
			СинонимРегистратора = Метаданные["Справочники"][Регистратор].Синоним;
			
			СтрокаЗаголовка = НСтр("ru = 'Справочник ""%Регистратор%""'");
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			
			СинонимРегистратора = Метаданные["Документы"][Регистратор].Синоним;
			
			СтрокаЗаголовка = НСтр("ru = 'Документ ""%Регистратор%""'");
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("ДокументСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
			
			Элементы.ГруппаКнопкиПроверки.Видимость = Ложь;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
			
			Элементы.ОбъектПроверки.Видимость = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	ДелениеПоАдресатам  = Параметры.ДелениеПоАдресатам;
	ФильтрПоАдресатам   = Параметры.ФильтрПоАдресатам;
	Если ФильтрПоАдресатам И (ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому) Тогда
		ТаблицаПолучателей.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыПолучателей));
		Элементы.ПроверкаТемыСообщения.Видимость = Ложь;
		Элементы.ПроверкаТекстаСообщения.Заголовок = "Проверка темы и текста сообщения для каждого из адресатов";
	КонецЕсли;
	
	// Таблицы
	Таблицы.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицШаблонов));
	
	СтрокаДобавить = Таблицы.Добавить();
	СтрокаДобавить.Имя = "<добавить таблицу>";
	ИдентификаторСтрокиТаблицДобавить = СтрокаДобавить.ПолучитьИдентификатор();
	
	Элементы.ГруппаТаблицы.Видимость = ТипСообщенияЭлПочта;
	
	// Печатные формы
	ПечатныеФормыДоступны = Ложь;
	
	Если ТипСообщенияЭлПочта
		И (ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник) Тогда
			
		Если ВерсияУТ = "10" Тогда
			ЗаполнитьСписокПечатныхФормУТ10(ПолучитьИзВременногоХранилища(Параметры.АдресПечатныхФорм));
			ПечатныеФормыДоступны = Истина;
		ИначеЕсли ВерсияУТ = "11" Тогда
			ЗаполнитьСписокПечатныхФормУТ11(ПолучитьИзВременногоХранилища(Параметры.АдресПечатныхФорм));
			ПечатныеФормыДоступны = Истина;
		КонецЕсли;
		
		ЗаполнитьСписокВыбораФорматаВложений();
	КонецЕсли;
	
	// Присоединенные файлы
	ТаблицаПрисоединенныхФайлов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресПрисоединенныхФайлов));
	
	Элементы.ПечатныеФормы.Видимость       = ПечатныеФормыДоступны;
	Элементы.ФорматВложений.Видимость      = ПечатныеФормыДоступны;
	Элементы.ДобавитьВложение.Видимость    = ТипСообщенияЭлПочта;
	
	Элементы.ГруппаПроверкаШаблона.Видимость = Ложь;
	
	Элементы.ЗаголовокВложений82.Видимость   = Не Платформа83;
	Элементы.УдалитьВложения.Видимость       = Не Платформа83;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		Если ТипЗнч(ИсточникВыбора) = Тип("КонструкторСхемыКомпоновкиДанных") Тогда // Отредактирована схема компоновки
			ИзмененаСхемаКомпоновкиДанных(ВыбранноеЗначение, АдресСхемыКомпоновкиШаблонов, КомпоновщикНастроек);
		КонецЕсли;
	#КонецЕсли
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда // Отредактирована структура таблицы
		ОбработатьДобавлениеИзменениеТаблицы(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовокВложений();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДоступныеПоляНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекстЭлемента = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(Элементы.ДоступныеПоля.ТекущаяСтрока).Поле);
	ПараметрыПеретаскивания.Значение = ОбработатьТекстОперанда(ТекстЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элемент.ТекущиеДанные.Имя = "<добавить таблицу>" Тогда
		Выполнение = Ложь;
	Иначе
		ТекстЭлемента = "Таблицы." + Элемент.ТекущиеДанные.Имя;
		ПараметрыПеретаскивания.Значение = ОбработатьТекстОперанда(ТекстЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПроверкиПриИзменении(Элемент)
	
	ПроверкаТемыСообщения.Удалить();
	ПроверкаТекстаСообщения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	
	ОткрытьФормуРедактированияТаблицы(ТекущиеДанные.АдресНастроек, ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ОткрытьФормуРедактированияТаблицы(, ИдентификаторСтрокиТаблицДобавить);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Имя = "<добавить таблицу>" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Имя = "<добавить таблицу>" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатныеФормыПриИзменении(Элемент)
	
	ОбновитьЗаголовокВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокВложенийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайла = Лев(НавигационнаяСсылкаФорматированнойСтроки,
		СтрДлина(НавигационнаяСсылкаФорматированнойСтроки) - СтрДлина("ОткрытьФайл_d8d4e005-6748-46a3-b48f-7216f988a286") - 1);
	
	Если Найти(НавигационнаяСсылкаФорматированнойСтроки, "ОткрытьФайл_d8d4e005-6748-46a3-b48f-7216f988a286") Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Имя", ИмяФайла);
		СтрокиПрисоединенныхФайлов = ТаблицаПрисоединенныхФайлов.НайтиСтроки(Отбор);
		Для каждого СтрокаПрисоединенногоФайла Из СтрокиПрисоединенныхФайлов Цикл
			ОткрытьФайл(СтрокаПрисоединенногоФайла);
		КонецЦикла;
		
	ИначеЕсли Найти(НавигационнаяСсылкаФорматированнойСтроки, "УдалитьФайл_f11fba53-abab-4616-a7e2-2faec7bba8e1") Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ПечатнаяФорма", ИмяФайла);
		СтрокиПечатныхФорм = ПечатныеФормы.НайтиСтроки(Отбор);
		Для каждого СтрокаПечатнойФормы Из СтрокиПечатныхФорм Цикл
			СтрокаПечатнойФормы.Пометка = Ложь;
		КонецЦикла;
		
		УдаляемыеФайлы = Новый Массив;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Имя", ИмяФайла);
		СтрокиПрисоединенныхФайлов = ТаблицаПрисоединенныхФайлов.НайтиСтроки(Отбор);
		Для каждого СтрокаПрисоединенногоФайла Из СтрокиПрисоединенныхФайлов Цикл
			ТаблицаПрисоединенныхФайлов.Удалить(СтрокаПрисоединенногоФайла);
		КонецЦикла;
		
		ОбновитьЗаголовокВложений();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСообщениеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПриСменеСтраницыСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТекстаСообщенияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ДанныеСобытия.Href <> Неопределено Тогда
		ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ЗавершитьРедактированиеТекстов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	Если ЗначениеЗаполнено(ОбъектПроверки)
		Или ТипОбъекта = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.РегламентнаяПроверка")
		Или ТипОбъекта = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.Рассылка") Тогда
		
		Если Элементы.ГруппаСообщение.ТекущаяСтраница = Элементы.СтраницаТекстШаблона Тогда
			ПолучитьHTMLИзПоляHTMLДокумента();
		Иначе
			ТекстШаблона = КодHTML.ПолучитьТекст();
		КонецЕсли;
		
		ПроверитьШаблоныНаСервере();
		
		Если Не ОбычныйТекст Тогда
			ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовПроверки(Команда)

	Элементы.ГруппаПроверкаШаблона.Видимость = НЕ Элементы.ГруппаПроверкаШаблона.Видимость;
	Элементы.ПроверкаШаблонов.Картинка =
		?(Элементы.ГруппаПроверкаШаблона.Видимость, БиблиотекаКартинок.ПЛ_Свернуть, БиблиотекаКартинок.ПЛ_Развернуть);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбычныйТекст(Команда)
	
	Если Не ОбычныйТекст Тогда
		ПолучитьHTMLИзПоляHTMLДокумента();
		ВыполнитьПереключениеОбычныйТекст();
	Иначе
		ВыполнитьПереключениеHTML();
	КонецЕсли;
	
	Элементы.ОбычныйТекст.Пометка = ОбычныйТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхему(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиШаблонов);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиШаблонов)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		Предупреждение(НСтр("ru='Для редактирования схемы компоновки необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайла(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.ПолноеИмяФайла = "";
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		ВыборФайла.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		
		Если ВыборФайла.Выбрать() Тогда
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВыборФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			ЗагрузитьСхемуИзФайлаНаСервере(Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеВТемуСообщения(Команда)
	
	ВставитьТекстВШаблон(Элементы.ТемаСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеВТекстСообщения(Команда)
	
	Если ОбычныйТекст Тогда
		ВставитьТекстВШаблон(Элементы.ТемаСообщения);
	Иначе
		Если Элементы.ГруппаСообщение.ТекущаяСтраница = Элементы.СтраницаТекстШаблона Тогда
			ВставитьТекстВШаблонHTML();
		Иначе
			ВставитьТекстВШаблон(Элементы.КодHTML);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицуВТекстСообщения(Команда)
	
	ВставитьТаблицуВШаблон();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложение(Команда)
	
	#Если Не Вебклиент Тогда
	ВыбратьФайл82();
	
	ОбновитьЗаголовокВложений();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложения(Команда)
	
	ТаблицаПрисоединенныхФайлов.Очистить();
	
	ОбновитьЗаголовокВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(СтрокаПрисоединенногоФайла)
	
	ИмяФайла = СохранитьФайл(ТаблицаПрисоединенныхФайлов.Индекс(СтрокаПрисоединенногоФайла));
	
	Попытка
		ЗапуститьПриложение(ИмяФайла);
	Исключение
		ВызватьИсключение НСтр("ru = 'Ошибка при открытии файла.'");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СохранитьФайл(ИндексСтроки)
	
	СтрокаПрисоединенногоФайла = ТаблицаПрисоединенныхФайлов[ИндексСтроки];
	
	ИмяФайла = КаталогВременныхФайлов() + СтрокаПрисоединенногоФайла.Имя;
	
	ДанныеФайла = СтрокаПрисоединенногоФайла.Вложение.Получить();
	Если ДанныеФайла <> Неопределено Тогда
		ДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

&НаКлиенте
Процедура ВставитьHTMLИзБуфера(Команда)
	
	ВыполнитьHTMLКоманду("paste");
	
КонецПроцедуры

&НаКлиенте
Процедура ВырезатьHTML(Команда)
	
	ВыполнитьHTMLКоманду("cut");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьHTMLИзФайла(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор шаблона HTML'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВставитьHTMLПослеВыбораФайла", ЭтаФорма);
	ВыборФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьHTMLПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И ТипЗнч(Результат) = Тип("Массив")
		И Результат.Количество() > 0 Тогда
		
		КодHTML.НачатьЧтение(, Результат[0], КодировкаТекста.UTF8);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированиеОтложенно()
	
	Форматирование(Команды.Найти("ФорматированиеПолужирный"));
	
КонецПроцедуры

&НаКлиенте
Процедура Форматирование(Команда) Экспорт
	
	Если ОбычныйТекст Тогда
		ВыделенныйТекст = Элементы.ТекстСообщения.ВыделенныйТекст;
		ОбычныйТекст(Команда);
		ПодключитьОбработчикОжидания("ФорматированиеОтложенно", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыделенныйТекст) Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		Область = HTMLДокумент.body.createTextRange();
		Область.findText(ВыделенныйТекст);
		Область.select();
	КонецЕсли;
	
	Если Команда.Имя = "ФорматированиеПолужирный" Тогда
		ВыполнитьHTMLКоманду("bold");
		
	ИначеЕсли Команда.Имя = "ФорматированиеНаклонный" Тогда
		ВыполнитьHTMLКоманду("italic");
		
	ИначеЕсли Команда.Имя = "ФорматированиеПодчеркнутый" Тогда
		ВыполнитьHTMLКоманду("underline");
		
	ИначеЕсли Команда.Имя = "ФорматированиеМаркированныйСписок" Тогда
		ВыполнитьHTMLКоманду("insertUnorderedList");
		
	ИначеЕсли Команда.Имя = "ФорматированиеНумерованныйСписок" Тогда
		ВыполнитьHTMLКоманду("insertOrderedList");
		
	ИначеЕсли Команда.Имя = "ФорматированиеОтступВлево" Тогда
		ВыполнитьHTMLКоманду("outdent");
		
	ИначеЕсли Команда.Имя = "ФорматированиеОтступВправо" Тогда
		ВыполнитьHTMLКоманду("indent");
		
	ИначеЕсли Команда.Имя = "ФорматированиеВыравниваниеВлево" Тогда
		ВыполнитьHTMLКоманду("justifyLeft");
		
	ИначеЕсли Команда.Имя = "ФорматированиеВыравниваниеПоЦентру" Тогда
		ВыполнитьHTMLКоманду("justifyCenter");
		
	ИначеЕсли Команда.Имя = "ФорматированиеВыравниваниеВправо" Тогда
		ВыполнитьHTMLКоманду("justifyRight");
		
	ИначеЕсли Команда.Имя = "ФорматированиеИзменитьШрифт" Тогда
		ДиалогВыбораШрифта = Новый ДиалогВыбораШрифта;
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеИзменитьШрифт", ЭтаФорма);
		ДиалогВыбораШрифта.Показать(ОписаниеОповещения);
		
	ИначеЕсли Команда.Имя = "ФорматированиеЦветТекста" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборЦветаТекста", ЭтаФорма);
		ПараметрыФормы = Новый Структура("Заголовок", НСтр("ru = 'Цвет текста'"));
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ВыборЦвета", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
		
	ИначеЕсли Команда.Имя = "ФорматированиеЦветФона" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборЦветаФона", ЭтаФорма);
		ПараметрыФормы = Новый Структура("Заголовок", НСтр("ru = 'Цвет фона'"));
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ВыборЦвета", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
		
	ИначеЕсли Команда.Имя = "ФорматированиеОчиститьФормат" Тогда
		ВыполнитьHTMLКоманду("removeFormat");
	КонецЕсли;
	
	ВыделенныйТекст = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеИзменитьШрифт(Шрифт, Параметры) Экспорт

	Если Шрифт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Шрифт.Имя) Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		HTMLДокумент.execCommand("fontName", Ложь, Шрифт.Имя);
	КонецЕсли;
	
	РазмерШрифта = 2;
	
	Если Шрифт.Размер <> -1 Тогда
		Если Шрифт.Размер < 8 Тогда
			РазмерШрифта = 1;
		ИначеЕсли Шрифт.Размер <= 10 Тогда
			РазмерШрифта = 2;
		ИначеЕсли Шрифт.Размер <= 12 Тогда
			РазмерШрифта = 3;
		ИначеЕсли Шрифт.Размер <= 14 Тогда
			РазмерШрифта = 4;
		ИначеЕсли Шрифт.Размер <= 16 Тогда
			РазмерШрифта = 5;
		ИначеЕсли Шрифт.Размер <= 18 Тогда
			РазмерШрифта = 6;
		Иначе
			РазмерШрифта = 7;
		КонецЕсли;
	КонецЕсли;
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	HTMLДокумент.execCommand("fontSize", Ложь, РазмерШрифта);
	
	Если Шрифт.Зачеркивание = Истина Тогда
		HTMLДокумент = Элементы.ТекстПисьмаHTML.Документ;
		ВыполнитьHTMLКоманду("strikeThrough");
	КонецЕсли;
	
	Если Шрифт.Жирный = Истина Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		ВыполнитьHTMLКоманду("Bold");
	КонецЕсли;
	
	Если Шрифт.Наклонный = Истина Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		ВыполнитьHTMLКоманду("italic");
	КонецЕсли;
	
	Если Шрифт.Подчеркивание = Истина Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		ВыполнитьHTMLКоманду("underline");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборЦветаТекста(Цвет, Параметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		HTMLДокумент.execCommand("foreColor", Ложь, Цвет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборЦветаФона(Цвет, Параметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		HTMLДокумент.execCommand("backColor", Ложь, Цвет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРазмерШрифта(Команда)
	
	Если Команда.Имя = "ФорматированиеУвеличитьШрифт" Тогда
		РазмерПоУмолчанию = 2;
		ИзменениеРазмера = 1;
	ИначеЕсли Команда.Имя = "ФорматированиеУменьшитьШрифт" Тогда
		РазмерПоУмолчанию = 3;
		ИзменениеРазмера = -1;
	Иначе
		Возврат;
	КонецЕсли;
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	Размер = HTMLДокумент.queryCommandValue("fontSize");
	
	Если Не ЗначениеЗаполнено(Размер) Тогда 
		Размер = РазмерПоУмолчанию;
	КонецЕсли;
	HTMLДокумент.execCommand("fontSize", Ложь, Размер + ИзменениеРазмера);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ТекстСообщенияHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированиеВставитьКартинку(Команда)
	
	Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf'")
		+ НСтр("ru = '|Все файлы(*.*)|*.*'")
		+ НСтр("ru = '|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle'")
		+ НСтр("ru = '|Формат GIF(*.gif*)|*.gif'")
		+ НСтр("ru = '|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg'")
		+ НСтр("ru = '|Формат PNG(*.png*)|*.png'")
		+ НСтр("ru = '|Формат TIFF(*.tif)|*.tif'")
		+ НСтр("ru = '|Формат icon(*.ico)|*.ico'")
		+ НСтр("ru = '|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор картинки'");
	ВыборФайла.Фильтр = Фильтр;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВставитьКартинкуПослеВыбораФайла", ЭтаФорма);
	ВыборФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинкуПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И ТипЗнч(Результат) = Тип("Массив")
		И Результат.Количество() > 0 Тогда
		
		ПутьФайла = Результат[0];
		
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		HTMLДокумент.execCommand("InsertImage", Ложь, "file://" + ПутьФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированиеВставитьСсылку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСсылки", ЭтаФорма);
	ПоказатьВводСтроки(Оповещение,, НСтр("ru = 'Ссылка'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСсылки(Ссылка, ДополнительныеПараметры) Экспорт
	
	Если Ссылка <> Неопределено Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		HTMLДокумент.execCommand("createLink", Ложь, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрHTML(Команда)
	
	ИмяФайла = ЗаписатьФайлПросмотраHTML();
	
	Попытка
		ЗапуститьПриложение(ИмяФайла);
	Исключение
		ВызватьИсключение НСтр("ru = 'Ошибка при открытии файла.'");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлПросмотраHTML()
	
	ИмяФайла = ПолучитьИмяВременногоФайла("html");
	
	КодHTML.Записать(ИмяФайла);
	
	Возврат ИмяФайла;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ТипСообщенияЭлПочта = (ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
		Или ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки);
	
	Элементы.СтраницаИсходныйКод.Видимость    = ТипСообщенияЭлПочта;
	Элементы.ОбычныйТекст.Видимость           = ТипСообщенияЭлПочта;
	Элементы.ГруппаКомандыHTML.Видимость      = ТипСообщенияЭлПочта;
	
	Элементы.ТекстСообщенияHTML.Видимость     = Не ОбычныйТекст;
	Элементы.ТекстСообщения.Видимость         = ОбычныйТекст;
	
	Если ТипСообщенияЭлПочта Тогда
		Элементы.ГруппаСообщение.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ГруппаСообщение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	Элементы.СтраницаИсходныйКод.Доступность = Не ОбычныйТекст;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	ПЛ_УведомленияОСобытиях.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, УникальныйИдентификатор)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиШаблонов, КомпоновщикНастроек);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных, КомпоновщикНастроек)
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
	// Компоновщик настроек инициализируется редактируемой схемой
	ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеТекстов()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипСообщения", ТипСообщения);
	
	Таблицы.Удалить(Таблицы.Индекс(Таблицы.НайтиПоИдентификатору(ИдентификаторСтрокиТаблицДобавить)));
	ЗаполнитьСтруктуруПараметровРедактированияШаблона(
		Результат,
		КомпоновщикНастроек,
		АдресСхемыКомпоновкиШаблонов,
		ИдентификаторВладельца,
		Таблицы,
		ПечатныеФормы,
		ТаблицаПрисоединенныхФайлов);
		
	Если ТипСообщения = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта")
		Или ТипСообщения = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки") Тогда
		
		Если Элементы.ГруппаСообщение.ТекущаяСтраница = Элементы.СтраницаТекстШаблона Тогда
			ПолучитьHTMLИзПоляHTMLДокумента();
		Иначе
			ТекстШаблона = КодHTML.ПолучитьТекст();
		КонецЕсли;
		
		Результат.Вставить("ТемаСообщения",     СокрЛП(ТемаСообщения.ПолучитьТекст()));
		Результат.Вставить("ТекстСообщения",    ТекстШаблона);
		Результат.Вставить("ОбычныйТекст",      ОбычныйТекст);
		Результат.Вставить("ФорматВложений",    ФорматВложений);
		
	ИначеЕсли ТипСообщения = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СМС") Тогда
		
		Результат.Вставить("ТекстСообщения",   ТекстШаблона);
		
	ИначеЕсли ТипСообщения = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение") Тогда
		
		Результат.Вставить("ТемаСообщения",    СокрЛП(ТемаСообщения.ПолучитьТекст()));
		Результат.Вставить("ТекстСообщения",   ТекстШаблона);
		
	КонецЕсли;
	
	Оповестить("Завершено_редактирование_текстов_сообщения", Результат, ЭтаФорма);
	
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСтруктуруПараметровРедактированияШаблона(
		Результат,
		КомпоновщикНастроек,
		АдресСхемыКомпоновкиШаблонов,
		ИдентификаторВладельца,
		Знач Таблицы,
		Знач ПечатныеФормы,
		Знач ТаблицаПрисоединенныхФайлов)
	
	// Настройки компоновщика настроек помещаются в редактируемую схему
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиШаблонов);
	
	Результат.Вставить("АдресСхемы",        АдресСхемыКомпоновкиШаблонов);
	Результат.Вставить("АдресНастроек",     ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, ИдентификаторВладельца));
	
	Результат.Вставить("АдресТаблиц",       ПолучитьАдресТаблиц(Таблицы));
	Результат.Вставить("АдресПечатныхФорм", ПолучитьАдресТаблиц(ПечатныеФормы));
	Результат.Вставить("АдресПрисоединенныхФайлов", ПолучитьАдресТаблиц(ТаблицаПрисоединенныхФайлов));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияТаблицы(АдресНастроекКомпоновки = "", ИдентификаторСтроки = -1)
	
	ПараметрыРедактированияТаблицы = Новый Структура;
	
	ПараметрыРедактированияТаблицы.Вставить("АдресСхемыКомпоновки",     АдресСхемыКомпоновкиШаблонов);
	ПараметрыРедактированияТаблицы.Вставить("АдресНастроекКомпоновки",  АдресНастроекКомпоновки);
	ПараметрыРедактированияТаблицы.Вставить("ИдентификаторСтроки",      ИдентификаторСтроки);
	ПараметрыРедактированияТаблицы.Вставить("УникальныйИдентификатор",  ИдентификаторВладельца); // ИД формы уведомлений для размещения возвращаемых значений
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкаСтруктурыТаблицы",
		ПараметрыРедактированияТаблицы,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДобавлениеИзменениеТаблицы(СтруктураРезультата)
	
	Если СтруктураРезультата.ИдентификаторСтроки = ИдентификаторСтрокиТаблицДобавить Тогда
		СтрокаТаблицы = Таблицы.Вставить(Таблицы.Количество() - 1);
		СтрокаТаблицы.Имя = "Таблица " + Строка(Таблицы.Количество() - 1);
		СтрокаТаблицы.АдресНастроек = СтруктураРезультата.АдресНастроек;
		Элементы.Таблицы.ТекущаяСтрока = Таблицы.Индекс(СтрокаТаблицы);
	Иначе
		СтрокаТаблицы = Таблицы.НайтиПоИдентификатору(СтруктураРезультата.ИдентификаторСтроки);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.АдресНастроек = СтруктураРезультата.АдресНастроек;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблиц(Знач Таблицы)
	
	Возврат ПоместитьВоВременноеХранилище(Таблицы.Выгрузить(), Новый УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПечатныхФормУТ10(ТаблицаПечатныхФорм)
	
	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Возврат;
	КонецЕсли;
	
	// Встроенные печатные формы
	//СтруктураПечатныхФорм = Неопределено;
	//Попытка
	//	Выполнить("СтруктураПечатныхФорм = Документы[Регистратор].СоздатьДокумент().ПолучитьСтруктуруПечатныхФорм()");
	//Исключение
	//КонецПопытки;
	//
	//Если ТипЗнч(СтруктураПечатныхФорм) = Тип("Структура") Тогда
	//	Для каждого ЭлементСтруктуры Из СтруктураПечатныхФорм Цикл
	//		
	//		НоваяСтрока = ПечатныеФормы.Добавить();
	//		НоваяСтрока.ПечатнаяФорма = ЭлементСтруктуры.Значение;
	//		
	//		Если ТаблицаПечатныхФорм.Найти(ЭлементСтруктуры.Значение) <> Неопределено Тогда
	//			НоваяСтрока.Пометка = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	// Внешние печатные формы
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка,
		|	ДанныеСправочника.Ссылка.Наименование       КАК Наименование,
		|	ДанныеСправочника.ЗаменяемаяПечатнаяФорма   КАК ЗаменяемаяПечатнаяФорма
		|ИЗ
		|	Справочник.ВнешниеОбработки.Принадлежность КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.СсылкаОбъекта = &ПустаяСсылка
		|	И ДанныеСправочника.Ссылка.ВидОбработки = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма)
		|	И (НЕ ДанныеСправочника.ЗаменяемаяПечатнаяФорма ССЫЛКА Справочник.ВнешниеОбработки)
		|	И (НЕ ДанныеСправочника.Ссылка.ПометкаУдаления)
		|";
		
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			Запрос.УстановитьПараметр("ПустаяСсылка", Документы[Регистратор].ПустаяСсылка());
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочникт Тогда
			Запрос.УстановитьПараметр("ПустаяСсылка", Справочники[Регистратор].ПустаяСсылка());
		Иначе
			Возврат;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ЗаменяемаяПечатнаяФорма) Тогда
				ИмяПечатнойФормы = Выборка.ЗаменяемаяПечатнаяФорма;
			Иначе
				ИмяПечатнойФормы = Выборка.Наименование;
			КонецЕсли;
			
			НоваяСтрока = ПечатныеФормы.Добавить();
			НоваяСтрока.Внешняя = Истина;
			НоваяСтрока.ПечатнаяФорма = ИмяПечатнойФормы;
			
			Если ТаблицаПечатныхФорм.Найти(ИмяПечатнойФормы) <> Неопределено Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПечатныхФормУТ11(ТаблицаПечатныхФорм)
	
	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПолноеИмяОбъектаМетаданных = "";
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			ПолноеИмяОбъектаМетаданных = "Документ." + Регистратор;
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			ПолноеИмяОбъектаМетаданных = "Справочник." + Регистратор;
		Иначе
			Возврат;
		КонецЕсли;
		
		// Встроенные печатные формы
		КоллекцияКомандПечати = "";
		Выполнить("КоллекцияКомандПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати()");
		Выполнить("ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъектаМетаданных).ДобавитьКомандыПечати(КоллекцияКомандПечати)");
		
		Для каждого СтрокаКомандыПечати из КоллекцияКомандПечати Цикл
			Если Не СтрокаКомандыПечати.СразуНаПринтер Тогда
				
				НоваяСтрока = ПечатныеФормы.Добавить();
				НоваяСтрока.ПечатнаяФорма = СтрокаКомандыПечати.Представление;
				
				Если ТаблицаПечатныхФорм.Найти(СтрокаКомандыПечати.Представление) <> Неопределено Тогда
					НоваяСтрока.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Внешние печатные формы
		//ВнешниеПечатныеФормы = УправлениеПечатью.СписокПечатныхФормИзВнешнихИсточников(ПолноеИмяОбъектаМетаданных);
		//Для каждого СтрокаВнешнейПечатнойФормы из ВнешниеПечатныеФормы Цикл
		//	
		//	НоваяСтрока = ПечатныеФормы.Добавить();
		//	НоваяСтрока.ПечатнаяФорма = СтрокаВнешнейПечатнойФормы.Представление;
		//	НоваяСтрока.Внешняя = Истина;
		//	
		//	Если ТаблицаПечатныхФорм.Найти(СтрокаВнешнейПечатнойФормы.Представление) <> Неопределено Тогда
		//		НоваяСтрока.Пометка = Истина;
		//	КонецЕсли;
		//КонецЦикла;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокВложений()
	
	Если Платформа83 Тогда
		
		ЗаголовокВложений = "";
		
		МассивСтрок = Новый Массив;
		
		Для каждого СтрокаПечатныхФорм Из ПечатныеФормы Цикл
			Если СтрокаПечатныхФорм.Пометка Тогда
				ДобавитьСтрокуВложения(МассивСтрок, СтрокаПечатныхФорм.ПечатнаяФорма);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаВложений Из ТаблицаПрисоединенныхФайлов Цикл
			ДобавитьСтрокуВложения(МассивСтрок, СтрокаВложений.Имя, Истина);
		КонецЦикла;
		
		ЗаголовокВложений = ПЛ_Функции83.ФорматированнаяСтрокаИзМассиваСтрок(МассивСтрок);
		
	Иначе
		
		ЗаголовокВложений82 = "";
		
		Для каждого СтрокаПечатныхФорм Из ПечатныеФормы Цикл
			Если СтрокаПечатныхФорм.Пометка Тогда
				ЗаголовокВложений82 = ЗаголовокВложений82 + ?(ЗаголовокВложений82 = "", "", "  ") + СтрокаПечатныхФорм.ПечатнаяФорма;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаВложений Из ТаблицаПрисоединенныхФайлов Цикл
			ЗаголовокВложений82 = ЗаголовокВложений82 + ?(ЗаголовокВложений82 = "", "", "  ") + СтрокаВложений.Имя;
		КонецЦикла;
	КонецЕсли;
	
	Если Платформа83 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(ЗаголовокВложений, Символы.ПС);
		КоличествоФайлов = Подстроки.Количество();
		Элементы.ЗаголовокВложений.Видимость = КоличествоФайлов;
		Элементы.ЗаголовокВложений.Высота = КоличествоФайлов;
	Иначе
		Подстроки = РазложитьСтрокуВМассивПодстрок(ЗаголовокВложений82, Символы.ПС);
		КоличествоФайлов = Подстроки.Количество();
		Элементы.ЗаголовокВложений82.Видимость = КоличествоФайлов;
		Элементы.ЗаголовокВложений82.Высота = КоличествоФайлов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокуВложения(МассивСтрок, ИмяВложения, Гиперссылка = Ложь)
	
	СтрокаГиперссылки = ПЛ_Функции83.ФорматированнаяСтрокаПоОписанию(ИмяВложения,,,,
		?(Гиперссылка, ИмяВложения + "_ОткрытьФайл_d8d4e005-6748-46a3-b48f-7216f988a286", ""));
	СтрокаУдаления = ПЛ_Функции83.ФорматированнаяСтрокаПоОписанию(БиблиотекаКартинок.Очистить,,,,
		ИмяВложения + "_УдалитьФайл_f11fba53-abab-4616-a7e2-2faec7bba8e1");
	
	МассивСтрок.Добавить(СтрокаГиперссылки);
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(СтрокаУдаления);
	МассивСтрок.Добавить("  ");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораФорматаВложений()
	
	ДоступныеФорматы = Новый ТаблицаЗначений;
	ДоступныеФорматы.Колонки.Добавить("Порядок");
	ДоступныеФорматы.Колонки.Добавить("Значение");
	ДоступныеФорматы.Колонки.Добавить("Представление");
	
	Для каждого ТипФайла Из ТипФайлаТабличногоДокумента Цикл
		
		Если Строка(ТипФайла) = "PDF" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.Значение = "PDF";
			НоваяСтрока.Представление = "Документ Adobe PDF (.pdf)";
			
		ИначеЕсли Строка(ТипФайла) = "DOCX" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 2;
			НоваяСтрока.Значение = "DOCX";
			НоваяСтрока.Представление = "Документ Word 2007 (.docx)";
			
		ИначеЕсли Строка(ТипФайла) = "XLS97" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.Значение = "XLS97";
			НоваяСтрока.Представление = "Лист Microsoft Excel 97-2003 (.xls)";
			
		ИначеЕсли Строка(ТипФайла) = "XLSX" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 4;
			НоваяСтрока.Значение = "XLSX";
			НоваяСтрока.Представление = "Лист Microsoft Excel 2007 (.xlsx)";
			
		ИначеЕсли Строка(ТипФайла) = "ODS" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 5;
			НоваяСтрока.Значение = "ODS";
			НоваяСтрока.Представление = "Электронная таблица Open Document (.ods)";
			
		ИначеЕсли Строка(ТипФайла) = "HTML5" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 6;
			НоваяСтрока.Значение = "HTML5";
			НоваяСтрока.Представление = "Веб-страница (.html)";
			
		ИначеЕсли Строка(ТипФайла) = "HTML4" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 7;
			НоваяСтрока.Значение = "HTML4";
			НоваяСтрока.Представление = "Веб-страница (.html)";
			
		ИначеЕсли Строка(ТипФайла) = "TXT" Тогда
			НоваяСтрока = ДоступныеФорматы.Добавить();
			НоваяСтрока.Порядок = 8;
			НоваяСтрока.Значение = "TXT";
			НоваяСтрока.Представление = "Текстовый документ UTF-8 (.txt)";
			
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеФорматы.Найти("HTML5", "Значение") <> Неопределено Тогда
		СтрокаКУдалению = ДоступныеФорматы.Найти("HTML4", "Значение");
		Если СтрокаКУдалению <> Неопределено Тогда
			ДоступныеФорматы.Удалить(СтрокаКУдалению);
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеФорматы.Сортировать("Порядок");
	
	Для каждого ДоступныйФормат Из ДоступныеФорматы Цикл
		Элементы.ФорматВложений.СписокВыбора.Добавить(ДоступныйФормат.Значение, ДоступныйФормат.Представление);
	КонецЦикла;
	
	Если Элементы.ФорматВложений.СписокВыбора.Количество() И Не ЗначениеЗаполнено(ФорматВложений)  Тогда
		ФорматВложений = Элементы.ФорматВложений.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ".")
	
	Результат = Новый Массив;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если НЕ ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриСменеСтраницыСообщения()
	
	Если Элементы.ГруппаСообщение.ТекущаяСтраница = Элементы.СтраницаТекстШаблона Тогда
		
		ТекстШаблона = КодHTML.ПолучитьТекст();
		Если Не ОбычныйТекст Тогда
			ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
		КонецЕсли;
	Иначе
		ПолучитьHTMLИзПоляHTMLДокумента();
		КодHTML.УстановитьТекст(ТекстШаблона);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С HTML

&НаКлиенте
Процедура ПолучитьHTMLИзПоляHTMLДокумента()
	
	Если Не ОбычныйТекст Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		Если HTMLДокумент <> Неопределено Тогда
			Head = HTMLДокумент.head.innerHTML;
			Body = HTMLДокумент.body.innerHTML;
			ТекстШаблона = "<html><head>" + Head + "</head>" + "<body>" + Body + "</body></html>";
			ЗапомнитьПозициюHTML();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьПозициюHTML()
	
	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	
	Попытка
		ie9_body = HTMLДокумент.ie9_body;
	Исключение
		Возврат;
	КонецПопытки;
	
	Попытка
		
		Выделение = HTMLДокумент.getSelection();
		
		Узел = Выделение.getRangeAt(0).startContainer;
		ТекущееПоложениеНачало = Выделение.getRangeAt(0).startOffset;
		ТекущееПоложениеКонец = Выделение.getRangeAt(0).endOffset;
		
		Счетчик = 0;
		НайденныйНомерУзла = -1;
		Результат = НайтиНомерУзла(HTMLДокумент, Узел, Счетчик, НайденныйНомерУзла);
		
		ТекущийНомерУзла = НайденныйНомерУзла;
		
		ГоризонтальнаяПрокруткаHTML = HTMLДокумент.body.scrollLeft;
		ВертикальнаяПрокруткаHTML = HTMLДокумент.body.scrollTop;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиНомерУзла(ТекущийУзел, ВыделенныйУзел, Счетчик, НайденныйНомерУзла)
	
	Если ТекущийУзел.childNodes.length = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Узел Из ТекущийУзел.childNodes Цикл
		
		Счетчик = Счетчик + 1;
		
		Если Узел = ВыделенныйУзел Тогда
			НайденныйНомерУзла = Счетчик;
			Возврат Истина;
		КонецЕсли;
		
		Результат = НайтиНомерУзла(Узел, ВыделенныйУзел, Счетчик, НайденныйНомерУзла);
		Если Результат = Истина Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВыполнитьПереключениеОбычныйТекст()
	
	ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстИзHTML(ТекстШаблона);
	ОбычныйТекст = Истина;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПереключениеHTML()
	
	ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьHTMLИзТекста(ТекстШаблона);
	ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
	ОбычныйТекст = Ложь;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьHTMLКоманду(Команда)
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	HTMLДокумент.execCommand(Команда);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ШАБЛОНОМ

&НаКлиенте
Функция ОбработатьТекстОперанда(ТекстОперанда)
	
	Возврат "%%" + ТекстОперанда + "%%";
	
КонецФункции

&НаКлиенте
Процедура ВставитьТекстВШаблон(Элемент)
	
	ТекстСтроки = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(Элементы.ДоступныеПоля.ТекущаяСтрока).Поле);
	Операнд = ОбработатьТекстОперанда(ТекстСтроки);
	
	Если Элемент.Имя <> "КодHTML" Тогда
		Начало = ""; Конец = "";
		Элемент.ПолучитьГраницыВыделения(Начало, Конец);
		ЭтаФорма[Элемент.Имя].Вставить(Начало, Операнд);
	КонецЕсли;
	
	Элемент.ВыделенныйТекст = Операнд;
	ТекущийЭлемент = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстВШаблонHTML()
	
	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли
	
	ТекстСтроки = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(Элементы.ДоступныеПоля.ТекущаяСтрока).Поле);
	Операнд = ОбработатьТекстОперанда(ТекстСтроки);
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	HTMLДокумент.parentWindow.clipboardData.SetData("Text", Операнд);
	ВыполнитьHTMLКоманду("paste");
	
	ТекущийЭлемент = Элементы.ТекстСообщенияHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТаблицуВШаблон()
	
	ИмяТаблицы = Таблицы.НайтиПоИдентификатору(Элементы.Таблицы.ТекущаяСтрока).Имя;
	
	Если ИмяТаблицы <> "<добавить таблицу>" Тогда
		
		ТекстСтроки = "Таблицы." + ИмяТаблицы;
		Операнд = ОбработатьТекстОперанда(ТекстСтроки);
		
		Если Элементы.ГруппаСообщение.ТекущаяСтраница = Элементы.СтраницаТекстШаблона Тогда
			HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
			HTMLДокумент.parentWindow.clipboardData.SetData("Text", Операнд);
			ВыполнитьHTMLКоманду("paste");
			
			ТекущийЭлемент = Элементы.ТекстСообщенияHTML;
		Иначе
			Элементы.КодHTML.ВыделенныйТекст = Операнд;
			ТекущийЭлемент = Элементы.КодHTML;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьШаблоныНаСервере()
	
	СтрокаТемыСообщения = ТемаСообщения.ПолучитьТекст();
	СтрокаТекстаСообщения = "";
	СтруктураВложений = Новый Структура;
	
	СтрокаТекстаСообщения = ТекстШаблона;
	
	ШаблоныТаблиц = Таблицы.Выгрузить();
	ШаблоныТаблиц.Удалить(ШаблоныТаблиц[ШаблоныТаблиц.Количество()-1]);
	
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиШаблонов);
	АдресНастроек = ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, ИдентификаторВладельца);
	
	Если Не ФильтрПоАдресатам Тогда
		
		Попытка
			ПЛ_УведомленияОСобытиях.ТекстыПоШаблонам(ТипОбъекта, ОбъектПроверки,
				АдресСхемыКомпоновкиШаблонов, АдресНастроек,
				ШаблоныТаблиц, ОбычныйТекст,
				СтрокаТемыСообщения, СтрокаТекстаСообщения);
		Исключение
		КонецПопытки;
		
		ПроверкаТемыСообщения.Удалить();
		ПроверкаТемыСообщения.Добавить(СтрокаТемыСообщения);
		
		Если ОбычныйТекст Тогда
			ФорматированныйДокумент = Новый ФорматированныйДокумент;
			ФорматированныйДокумент.Добавить(СтрокаТекстаСообщения);
			ФорматированныйДокумент.ПолучитьHTML(ПроверкаТекстаСообщения, Новый Структура);
		Иначе
			ДокументHTML = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьДокументHTMLИзТекстаHTML(СтрокаТекстаСообщения);
			ПроверкаТекстаСообщения = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстHTMLИзДокументаHTML(ДокументHTML);
		КонецЕсли;
		
	// Выборка при отправке отдельно каждому адресату фильтруется для отбора данных каждого адресата в отдельности
	Иначе
		
		ТаблицаАдресатов = Новый ТаблицаЗначений;
		ТаблицаАдресатов.Колонки.Добавить("Адресат");
		ТаблицаАдресатов.Колонки.Добавить("Тема");
		ТаблицаАдресатов.Колонки.Добавить("Текст");
		
		ПоляВыбораАдресатов = Новый Массив;
		
		Для Каждого Получатель Из ТаблицаПолучателей Цикл
			
			Если Получатель.СпособАдресацииУведомления = Перечисления.ПЛ_СпособыАдресацииУведомлений.Запрос Тогда
				
				СписокАдресатов = ПЛ_УведомленияОСобытиях.ПолучитьСписокАдресатов(ТипОбъекта, ОбъектПроверки,
					Получатель.АдресСхемыВыборкиАдресатов, Получатель.АдресНастроекВыборкиАдресатов, ПоляВыбораАдресатов);
				Для каждого Адресат из СписокАдресатов Цикл
					СтрокаАдресата = ТаблицаАдресатов.Добавить();
					СтрокаАдресата.Адресат = Адресат;
				КонецЦикла;
				
			ИначеЕсли Получатель.СпособАдресацииУведомления = Перечисления.ПЛ_СпособыАдресацииУведомлений.СписокРассылки Тогда
				
				СписокРассылки = Получатель.Адресат.ПолучитьОбъект();
				АдресСхемыВыборкиАдресатов = ПоместитьВоВременноеХранилище(СписокРассылки.СхемаВыборки.Получить(), Новый УникальныйИдентификатор);
				АдресНастроекВыборкиАдресатов = ПоместитьВоВременноеХранилище(СписокРассылки.НастройкиВыборки.Получить(), Новый УникальныйИдентификатор);
				СписокАдресатов = ПЛ_УведомленияОСОбытиях.ПолучитьСписокАдресатов("", "", АдресСхемыВыборкиАдресатов, АдресНастроекВыборкиАдресатов);
				Для каждого Адресат из СписокАдресатов Цикл
					СтрокаАдресата = ТаблицаАдресатов.Добавить();
					СтрокаАдресата.Адресат = Адресат;
				КонецЦикла;
				
			Иначе
				СтрокаАдресата = ТаблицаАдресатов.Добавить();
				СтрокаАдресата.Адресат = Получатель.Адресат;
			КонецЕсли;
		КонецЦикла;
		
		Справочники.ПЛ_УведомленияОСобытиях.УдалитьПовторяющиесяЭлементыТаблицыЗначений(ТаблицаАдресатов, "Адресат");
		
		Попытка
			ПЛ_УведомленияОСобытиях.ДополнитьТаблицуАдресатовТекстамиПоШаблонам(ТипОбъекта, ОбъектПроверки,
				АдресСхемыКомпоновкиШаблонов, АдресНастроек,
				ШаблоныТаблиц, ОбычныйТекст,
				СтрокаТемыСообщения, СтрокаТекстаСообщения,
				ТаблицаАдресатов, ПоляВыбораАдресатов);
		Исключение
		КонецПопытки;
		
		Построитель = Новый ПостроительDOM;
		ЧтениеHTML = Новый ЧтениеHTML;
		
		ДокументHTMLИтог = Новый ДокументHTML("");
		ЭлементТело = ДокументHTMLИтог.СоздатьЭлемент("body");
		ДокументHTMLИтог.Тело = ЭлементТело;
		
		Для Каждого СтрокаАдресата из ТаблицаАдресатов Цикл
			
			ТекстовыйУзел = ДокументHTMLИтог.СоздатьТекстовыйУзел(Строка(СтрокаАдресата.Адресат));
			ДокументHTMLИтог.Тело.ДобавитьДочерний(ТекстовыйУзел);
			
			ЧтениеHTML.УстановитьСтроку(СтрокаАдресата.Тема);
			ДокументHTML = Построитель.Прочитать(ЧтениеHTML);
			
			Если ДокументHTML.Тело <> Неопределено Тогда
				ДочерниеУзлы = ПЛ_УведомленияОСобытияхКлиентСервер.ДочерниеУзлыСодержащиеHTML(ДокументHTML.Тело);
				Для каждого ТекЭлемент Из ДочерниеУзлы Цикл
					НовыйЭлемент = ДокументHTMLИтог.ИмпортироватьУзел(ТекЭлемент, Истина);
					ДокументHTMLИтог.Тело.ДобавитьДочерний(НовыйЭлемент);
				КонецЦикла;
			КонецЕсли;
			
			ЧтениеHTML.УстановитьСтроку(СтрокаАдресата.Текст);
			ДокументHTML = Построитель.Прочитать(ЧтениеHTML);
			
			Если ДокументHTML.Тело <> Неопределено Тогда
				ДочерниеУзлы = ПЛ_УведомленияОСобытияхКлиентСервер.ДочерниеУзлыСодержащиеHTML(ДокументHTML.Тело);
				Для каждого ТекЭлемент Из ДочерниеУзлы Цикл
					НовыйЭлемент = ДокументHTMLИтог.ИмпортироватьУзел(ТекЭлемент, Истина);
					ДокументHTMLИтог.Тело.ДобавитьДочерний(НовыйЭлемент);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		ПроверкаТекстаСообщения = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстHTMLИзДокументаHTML(ДокументHTMLИтог);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВЛОЖЕНИЯ

&НаКлиенте
Процедура ВыбратьФайл82()
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		ПолучитьДанныеФайлов(МассивФайлов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл83()
	
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеФайлов(МассивФайлов)
	
	Для каждого ИмяФайла Из МассивФайлов Цикл
		ВыбФайл = Новый Файл(ИмяФайла);
		
		Если ВыбФайл.Существует() Тогда
			Данные = Новый ДвоичныеДанные(ИмяФайла);
		
			НовоеВложение = ТаблицаПрисоединенныхФайлов.Добавить();
			НовоеВложение.Имя = ВыбФайл.Имя;
			НовоеВложение.Вложение = Новый ХранилищеЗначения(Данные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
